//
//
//// 단축키
//// 지정한 구문 주석		: Ctrl + k , c
//// 지정한 구문 주석 해체 : Ctrl + k , u
//// Alt Drag
//
//// 디버깅 단축키
//// f5			: 디버깅 시작, 다음 중단점 까지
//// f9			: 중단점 생성 및 해제
//// f10			: 디버깅 중 , 구문 수행(함수 진입 : f11(최소 단위))
//// Shift + f5	: 디버깅 종료
//
//// 조사식
//
//// 콘솔
//// 입출력 함수 printf(), scanf()
//
//// printf
//printf("abcdef %f \n", 20.1234f);
//
//for (int i = 0; i < 10; ++i)
//{
//	printf("Output i : %d\n", i);
//}
//
//// scanf
//
//int input = 0;
//
////scanf_s("%d", &input);
////printf("input : %d\n", input);
//
//
//// 함수 (2) , (3)
//
//// Stack , Queue
//// 함수가 사용하는 메모리 영역
//// 스택 메모리 영역
//
//// Factorial
//
//a = 5;
//int test = Factorial(a);
//printf("%d팩토리얼 : %d \n", a, test);
//
//
//// ------------------------------------------08/05-------------------------------
